test/load/load-test-quadratic-multiplayer.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">1000</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <UserParameters guiclass="UserParametersGui" testclass="UserParameters" testname="User Parameters">
          <collectionProp name="UserParameters.names">
            <stringProp name="2146976644">SESSION_ID</stringProp>
          </collectionProp>
          <collectionProp name="UserParameters.thread_values">
            <collectionProp name="-1753070663">
              <stringProp name="187832203">${__UUID}</stringProp>
            </collectionProp>
          </collectionProp>
          <boolProp name="UserParameters.per_iteration">true</boolProp>
        </UserParameters>
        <hashTree/>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
          <collectionProp name="Arguments.arguments">
            <elementProp name="JWT" elementType="Argument">
              <stringProp name="Argument.name">JWT</stringProp>
              <stringProp name="Argument.value">eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCIsImtpZCI6IjF4NG56WUV1RHQ0MkdPYWltRUxYRyJ9.eyJpc3MiOiJodHRwczovL2F1dGgtZGV2LnF1YWRyYXRpY2hxLmNvbS8iLCJzdWIiOiJnb29nbGUtb2F1dGgyfDExMDg5NDk2ODAxNzIwNTIyOTI0MyIsImF1ZCI6WyJodHRwczovL2xvY2FsaG9zdDo4MDAwIiwiaHR0cHM6Ly9kZXYtbmplN2R3OHMudXMuYXV0aDAuY29tL3VzZXJpbmZvIl0sImlhdCI6MTcwNTUzMTAzNywiZXhwIjoxNzA1NjE3NDM3LCJhenAiOiJZTmJxdTVTYUVwcFltUTlzMVAwVmJEbkYwT0JlOGFnaiIsInNjb3BlIjoib3BlbmlkIHByb2ZpbGUgZW1haWwgb2ZmbGluZV9hY2Nlc3MifQ.nbD-7Enpu4u8BEFlgoKPA9SJ7jgBTcHpBlsDZbLzwFmpOJEhzozTgu5qWMT-oux7lq-bgu2GJCXBSphZbdUw7OJbeiNke8JnOas9XU-vs74hI_uDmvCYfzUOpWvR9nUhnfaPL-0r8cvuD-T1_qcIZun6DExfLqSAEdZmfIENylYxMLj_0d1pYbrw7pLv_WeGbpQMBeC6ETKV43cstoJnBLDY9QfpZXExufZqbYmnDSS22BiRaTtJk_TrfD830_ndcmRH5etRgnHOc0xT0-EB-32dFNe7E1HFGBNPm8gPe1ptYMW4BJ41O-N2OI0oJfa3bexHiGsSIH4s3_f8n8Pn8Q</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="SHEET_ID" elementType="Argument">
              <stringProp name="Argument.name">SHEET_ID</stringProp>
              <stringProp name="Argument.value">753b4e8a-d875-431f-8085-cf0867014bd1</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </Arguments>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create file in API">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8000</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/v0/files</stringProp>
          <boolProp name="HTTPSampler.auto_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.BROWSER_COMPATIBLE_MULTIPART">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;name&quot;: &quot;untitled&quot;,&#xd;
    &quot;contents&quot;: &quot;{\&quot;sheets\&quot;:[{\&quot;name\&quot;:\&quot;Sheet 1\&quot;,\&quot;id\&quot;:{\&quot;id\&quot;:\&quot;${SHEET_ID}\&quot;},\&quot;order\&quot;:\&quot;a0\&quot;,\&quot;cells\&quot;:[],\&quot;code_cells\&quot;:[],\&quot;formats\&quot;:[],\&quot;columns\&quot;:[],\&quot;rows\&quot;:[],\&quot;offsets\&quot;:[[],[]],\&quot;borders\&quot;:{}}],\&quot;version\&quot;:\&quot;1.4\&quot;}&quot;,&#xd;
    &quot;version&quot;: &quot;1.5&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${JWT}</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor">
            <stringProp name="JSONPostProcessor.referenceNames">FILE_ID</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.uuid</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <eu.luminis.jmeter.wssampler.OpenWebSocketSampler guiclass="eu.luminis.jmeter.wssampler.OpenWebSocketSamplerGui" testclass="eu.luminis.jmeter.wssampler.OpenWebSocketSampler" testname="WebSocket Open Connection">
          <boolProp name="TLS">false</boolProp>
          <stringProp name="server">localhost</stringProp>
          <stringProp name="port">3001</stringProp>
          <stringProp name="path">/ws</stringProp>
          <stringProp name="connectTimeout">20000</stringProp>
          <stringProp name="readTimeout">6000</stringProp>
        </eu.luminis.jmeter.wssampler.OpenWebSocketSampler>
        <hashTree>
          <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager">
            <collectionProp name="CookieManager.cookies">
              <elementProp name="jwt" elementType="Cookie" testname="jwt">
                <stringProp name="Cookie.value">Bearer ${JWT}</stringProp>
                <boolProp name="Cookie.secure">false</boolProp>
                <longProp name="Cookie.expires">0</longProp>
                <boolProp name="Cookie.path_specified">true</boolProp>
                <boolProp name="Cookie.domain_specified">true</boolProp>
              </elementProp>
            </collectionProp>
            <boolProp name="CookieManager.clearEachIteration">false</boolProp>
            <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>
          </CookieManager>
          <hashTree/>
        </hashTree>
        <eu.luminis.jmeter.wssampler.RequestResponseWebSocketSampler guiclass="eu.luminis.jmeter.wssampler.RequestResponseWebSocketSamplerGui" testclass="eu.luminis.jmeter.wssampler.RequestResponseWebSocketSampler" testname="Enter Room">
          <boolProp name="createNewConnection">false</boolProp>
          <boolProp name="TLS">false</boolProp>
          <stringProp name="port">80</stringProp>
          <stringProp name="connectTimeout">20000</stringProp>
          <stringProp name="payloadType">Text</stringProp>
          <stringProp name="requestData">{
    &quot;type&quot;: &quot;EnterRoom&quot;,
    &quot;session_id&quot;:  &quot;${SESSION_ID}&quot;,
    &quot;user_id&quot;: &quot;google-oauth2|123456789&quot;,
    &quot;file_id&quot;: &quot;${FILE_ID}&quot;,
    &quot;sheet_id&quot;: &quot;${SHEET_ID}&quot;,
    &quot;selection&quot;: &quot;{\&quot;cursor\&quot;:{\&quot;x\&quot;:0,\&quot;y\&quot;:0}}&quot;,
    &quot;first_name&quot;: &quot;test&quot;,
    &quot;last_name&quot;: &quot;user&quot;,
    &quot;email&quot;: &quot;test.user@quadratichq.com&quot;,
    &quot;image&quot;: &quot;https://lh3.googleusercontent.com/a/ACg8ocLcJuKVkU7-Zr67hinRLyzgO_o3VOeMlOA17HcOlKe1fQ=s96-c&quot;,
    &quot;cell_edit&quot;: {
        &quot;active&quot;: false,
        &quot;text&quot;: &quot;&quot;,
        &quot;cursor&quot;: 0,
        &quot;code_editor&quot;: false
    },
    &quot;x&quot;: 0,
    &quot;y&quot;: 0,
    &quot;visible&quot;: false,
    &quot;viewport&quot;: &quot;{\&quot;x\&quot;:538.5,\&quot;y\&quot;:350.5,\&quot;bounds\&quot;:{\&quot;x\&quot;:-20,\&quot;y\&quot;:-20,\&quot;width\&quot;:1117,\&quot;height\&quot;:741,\&quot;type\&quot;:1},\&quot;sheetId\&quot;:\&quot;${SHEET_ID}\&quot;}&quot;,
    &quot;code_running&quot;: &quot;[]&quot;
}</stringProp>
          <stringProp name="readTimeout">6000</stringProp>
          <boolProp name="loadDataFromFile">false</boolProp>
        </eu.luminis.jmeter.wssampler.RequestResponseWebSocketSampler>
        <hashTree/>
        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">5</stringProp>
        </LoopController>
        <hashTree>
          <eu.luminis.jmeter.wssampler.RequestResponseWebSocketSampler guiclass="eu.luminis.jmeter.wssampler.RequestResponseWebSocketSamplerGui" testclass="eu.luminis.jmeter.wssampler.RequestResponseWebSocketSampler" testname="Send Transaction">
            <boolProp name="createNewConnection">false</boolProp>
            <boolProp name="TLS">false</boolProp>
            <stringProp name="port">80</stringProp>
            <stringProp name="connectTimeout">20000</stringProp>
            <stringProp name="payloadType">Text</stringProp>
            <stringProp name="requestData">{
    &quot;type&quot;: &quot;Transaction&quot;,
    &quot;id&quot;: &quot;${__UUID}&quot;,
    &quot;session_id&quot;: &quot;${SESSION_ID}&quot;,
    &quot;file_id&quot;: &quot;${FILE_ID}&quot;,
    &quot;operations&quot;: &quot;[{\&quot;SetCellValues\&quot;:{\&quot;sheet_rect\&quot;:{\&quot;min\&quot;:{\&quot;x\&quot;:0,\&quot;y\&quot;:6},\&quot;max\&quot;:{\&quot;x\&quot;:0,\&quot;y\&quot;:6},\&quot;sheet_id\&quot;:{\&quot;id\&quot;:\&quot;${SHEET_ID}\&quot;}},\&quot;values\&quot;:{\&quot;size\&quot;:{\&quot;w\&quot;:1,\&quot;h\&quot;:1},\&quot;values\&quot;:[{\&quot;type\&quot;:\&quot;number\&quot;,\&quot;value\&quot;:\&quot;1\&quot;}]}}}]&quot;
}</stringProp>
            <stringProp name="readTimeout">6000</stringProp>
            <boolProp name="loadDataFromFile">false</boolProp>
          </eu.luminis.jmeter.wssampler.RequestResponseWebSocketSampler>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>